# installer tools
brew "mas"
brew "whalebrew"
brew "dockutil"

cask "nikitabobko/tap/aerospace"

# upgrade os tools
brew "bash"
brew "coreutils"
brew "curl"
brew "gpg"
brew "llvm"
brew "pkg-config"
brew "wget"
brew "zsh"

# git and github
brew "git"
brew "git-lfs"
brew "gh"

# browsers
cask "ungoogled-chromium"

# misc tools
brew "arduino-cli"
brew "direnv"
brew "fd"
brew "fzf"
brew "gnutls"
brew "icu4c" # for postgres
brew "jq"
brew "libyaml" # for ruby
brew "ripgrep"
brew "sqlite"
brew "watchexec"
brew "watchman"
cask "1password"
cask "bruno"
cask "caffeine"
cask "claude-code"
cask "docker-desktop"
cask "flux-app"
cask "ghostty@tip"
cask "notion-calendar"
cask "rocket"
cask "scroll-reverser"
cask "slack"

# nvim
brew "luarocks"
brew "nvim"
brew "xclip"
