# brewfile tools
brew "dockutil"
brew "mas"
brew "whalebrew"

# standard shell tools / upgrade os tools
brew "bash"
brew "entr"
brew "fzf"
brew "git"
brew "git-lfs"
brew "jq"
brew "wget"
brew "zsh"

# shell multiplexers
brew "tmux"
brew "zellij"

# misc dev tools
brew "postgresql"
brew "sqlite"
cask "tableplus"
cask "utm"

# nvim
brew "jq"
brew "libyaml"
brew "nvim"
brew "ripgrep"
brew "tidy-html5"

# iterm
cask "iterm2"

# utilities
brew "openssh"
cask "1password"
cask "1password-cli"
cask "caffeine"
cask "jetbrains-toolbox"
cask "mos"
cask "rectangle"
cask "elgato-stream-deck"
cask "elgato-camera-hub"

# browsers
cask "firefox"
cask "google-chrome"
cask "postman"
mas "velja", id: 1607635845

# docker / kubernetes
brew "kubectl"
cask "docker"

