# brewfile tools
brew "mas"
brew "whalebrew"

# standard shell tools / upgrade os tools
brew "bash"
brew "coreutils"
brew "curl"
brew "direnv"
brew "git"
brew "git-lfs"
brew "gh"
brew "gpg"
brew "icu4c" # for postgres
brew "jq"
brew "mise"
brew "pkg-config"
brew "openssh"
brew "watchexec"
brew "watchman"
brew "wget"
brew "zsh"

# misc dev tools
brew "sqlite"
cask "ghostty"
cask "tableplus"
brew "libyaml" # for ruby

# nvim
brew "fd"
brew "fzf"
brew "luarocks"
brew "nvim"
brew "ripgrep"
brew "xclip"

# utilities
brew "hledger"
cask "1password"
cask "chirp"
cask "docker"
cask "notion-calendar"
cask "openvpn-connect"
cask "qgis"
cask "raycast"
cask "scroll-reverser"
cask "slack"
mas "spark", id: 1176895641

# browsers
cask "firefox"

# cpp
# note we're not actually using this version of clang because it's managed by mise
# but we still want clang-tidy, etc
brew "llvm"
brew "platformio"
