akamud.vscode-theme-onedark
akamud.vscode-theme-onelight
asvetliakov.vscode-neovim
berikiushi.bronokai-theme
eamodio.gitlens
github.github-vscode-theme
github.vscode-pull-request-github
llvm-vs-code-extensions.vscode-clangd
ms-azuretools.vscode-docker
ms-vscode.cmake-tools
solomonkinard.git-blame
teabyii.ayu
