# misc
codezombiech.gitignore
eamodio.gitlens
vscodevim.vim

# themes
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
LinusU.auto-dark-mode
equinusocio.vsc-material-theme-icons
thomaspink.theme-github

# ruby
castwide.solargraph
kaiwood.endwise
ninoseki.vscode-gem-lens
rebornix.ruby
sporto.rails-go-to-spec
wingrunr21.vscode-ruby

# mjml
attilabuti.vscode-mjml

# go
ms-vscode.Go
windmilleng.vscode-go-autotest

# docker
ms-azuretools.vscode-docker
