brew "hledger"
cask "blender"
cask "calibre"
cask "discord"
cask "dosbox"
cask "godot"
cask "losslesscut"
cask "prusaslicer"
cask "qgis"
cask "retroarch"
cask "solvespace"
cask "steam"
cask "transmission"
cask "unity-hub"
cask "qflipper"
